app/Models/Aktuelle_ProjekteModel.php

SELECT `aufgaben`.`name` as `name`, `aufgaben`.`reiter` as `reiter`, group_concat("<li>", `mitglieder`.`username`, "</li>"  SEPARATOR "") as mitglieder
FROM `aufgaben`
LEFT JOIN `aufgaben_mitglieder` ON `aufgaben_mitglieder`.`aufgabeid`=`aufgaben`.`id`
LEFT JOIN `mitglieder` ON `aufgaben_mitglieder`.`mitgliedid`=`mitglieder`.`id`
GROUP BY `aufgaben`.`name`
ORDER BY `reiter`
---
    public function getData( ){
        $this->aufgaben=$this->db->table('aufgaben');
        $this->aufgaben->select('aufgaben.name as name, aufgaben.reiter as reiter, group_concat("<li>",  mitglieder.username, "</li>"  SEPARATOR "") as mitglieder');
        $this->aufgaben->join('aufgaben_mitglieder', 'aufgaben_mitglieder.aufgabeid=aufgaben.id', 'left');
        $this->aufgaben->join('mitglieder', 'aufgaben_mitglieder.mitgliedid=mitglieder.id', 'left');
        $this->aufgaben->orderBy('reiter');
        $this->aufgaben->groupBy('aufgaben.name');
        $result= $this->aufgaben->get();

SELECT *
FROM `reiter`
ORDER BY `id`
---
    public function getReiter(){
        $this->reiter=$this->db->table('reiter');
        $this->reiter->select('*');
        $this->reiter->orderBy('id');
        $result=$this->reiter->get();