app/Models/AufgabenModel.php

    public function getData( $id = NULL){
        $this->aufgaben=$this->db->table('aufgaben');
        $this->aufgaben->select('aufgaben.id as id, aufgaben.name As name, aufgaben.beschreibung As beschreibung, aufgaben.erstellungsdatum as erstellungsdatum, aufgaben.fälligkeitsdatum as fälligkeitsdatum , reiter.name As reiter, reiter.id as reiterid, group_concat("<li>", mitglieder.username, "</li>" SEPARATOR "") As zuständig') ;
        $this->aufgaben->join('reiter', 'aufgaben.reiter=reiter.id');
        $this->aufgaben->join('aufgaben_mitglieder', 'aufgaben_mitglieder.aufgabeid=aufgaben.id', 'left');
        $this->aufgaben->join('mitglieder', 'aufgaben_mitglieder.mitgliedid=mitglieder.id', 'left');


        if ($id!=NULL){
            $this->aufgaben->where('aufgaben.id',$id);
            $result= $this->aufgaben->get();
            return $result->getRowArray();
        }
        $this->aufgaben->orderBy('aufgaben.id');
        $this->aufgaben->groupBy('aufgaben.name');
        $result= $this->aufgaben->get();
---
SELECT `aufgaben`.`id` as `id`, `aufgaben`.`name` As `name`, `aufgaben`.`beschreibung` As `beschreibung`, `aufgaben`.`erstellungsdatum` as `erstellungsdatum`, `aufgaben`.`fälligkeitsdatum` as `fälligkeitsdatum`, `reiter`.`name` As `reiter`, `reiter`.`id` as `reiterid`, group_concat("<li>", `mitglieder`.`username`, "</li>" SEPARATOR "") As zuständig
FROM `aufgaben`
JOIN `reiter` ON `aufgaben`.`reiter`=`reiter`.`id`
LEFT JOIN `aufgaben_mitglieder` ON `aufgaben_mitglieder`.`aufgabeid`=`aufgaben`.`id`
LEFT JOIN `mitglieder` ON `aufgaben_mitglieder`.`mitgliedid`=`mitglieder`.`id`
WHERE `aufgaben`.`id` = '13'
SELECT `aufgaben`.`id` as `id`, `aufgaben`.`name` As `name`, `aufgaben`.`beschreibung` As `beschreibung`, `aufgaben`.`erstellungsdatum` as `erstellungsdatum`, `aufgaben`.`fälligkeitsdatum` as `fälligkeitsdatum`, `reiter`.`name` As `reiter`, `reiter`.`id` as `reiterid`, group_concat("<li>", `mitglieder`.`username`, "</li>" SEPARATOR "") As zuständig
FROM `aufgaben`
JOIN `reiter` ON `aufgaben`.`reiter`=`reiter`.`id`
LEFT JOIN `aufgaben_mitglieder` ON `aufgaben_mitglieder`.`aufgabeid`=`aufgaben`.`id`
LEFT JOIN `mitglieder` ON `aufgaben_mitglieder`.`mitgliedid`=`mitglieder`.`id`
GROUP BY `aufgaben`.`name`
ORDER BY `aufgaben`.`id`

    public function getReiter(){
        $this->reiter=$this->db->table('reiter');
        $this->reiter->select('*');
---
SELECT *
FROM `reiter`

    public function getMitglieder(){
        $this->mitglieder=$this->db->table('mitglieder');
        $this->mitglieder->select('*');
---
SELECT *
FROM `mitglieder`

    public function getAufagabenMitglieder($id=NULL){
        $this->aufgabenmitglieder=$this->db->table('aufgaben_mitglieder');
        $this->aufgabenmitglieder->select('mitgliedid');
        $this->aufgabenmitglieder->where('aufgabeid', $id);
---
SELECT `mitgliedid`
FROM `aufgaben_mitglieder`
WHERE `aufgabeid` = '13'

    public function deleteAufgabe() {
        $this->aufgabenmitglieder= $this->db->table('aufgaben_mitglieder');
        $this->aufgabenmitglieder->where('aufgabeid', $_POST['id']);
        $this->aufgabenmitglieder->delete();

        $this->aufgaben = $this->db->table('aufgaben');
        $this->aufgaben->where('aufgaben.id', $_POST['id']);
        $this->aufgaben->delete();
---
DELETE FROM `aufgaben_mitglieder`
WHERE `aufgabeid` = '33'
DELETE FROM `aufgaben`
WHERE `aufgaben`.`id` = '33'