app/Models/MitgliederModel.php

    public function login(){
        $this->personen= $this->db->table('mitglieder');
        $this->personen->select('*');
        $this->personen->where('mitglieder.e-mail', $_POST['email']);
---
SELECT *
FROM `mitglieder`
WHERE `mitglieder`.`e-mail` = 'joshua@zeller.de'

 public function getData( $id = NULL){
    $this->personen=$this->db->table('mitglieder');
    $this->personen->select('*');

    if ($id!=NULL){
        $this->personen->where('id',$id);
        $result= $this->personen->get();
        return $result->getRowArray();
    }
    $this->personen->orderBy('username');
     $result= $this->personen->get();
---
SELECT *
FROM `mitglieder`
WHERE `id` = '2'
SELECT *
FROM `mitglieder`
WHERE `id` = '9'
SELECT *
FROM `mitglieder`
ORDER BY `username`

    public function getPersoninProjekt($id=NULL){
        $this->personen=$this->db->table('projekte_mitglieder');
        $this->personen->select('mitgliedid, id, username');
        $this->personen->join('mitglieder', 'mitgliedid=mitglieder.id');
        $this->personen->where('projektid',$id);
        $result= $this->personen->get();
---
SELECT `id`
FROM `mitglieder`
LEFT JOIN `projekte_mitglieder` ON `mitgliedid`=`mitglieder`.`id`
WHERE `projektid` = '6'

    public function deletemitglied() {
        $this->personen = $this->db->table('mitglieder');
        $this->personen->where('mitglieder.id', $_POST['id']);
        $this->personen->delete();
---
DELETE FROM `mitglieder`
WHERE `mitglieder`.`id` = '4'