app/Models/ProjektModel.php

    public function getData( $id = NULL){
        $this->project=$this->db->table('projekte');
        $this->project->select('*');

        if ($id!=NULL){
            $this->project->where('id',$id);
            $result= $this->project->get();
            return $result->getRowArray();
        }
        $this->project->orderBy('id');
        $result= $this->project->get();
---
SELECT *
FROM `projekte`
ORDER BY `id`