app/Models/ReiterModel.php

SELECT *
FROM `reiter`
ORDER BY `id`
---
    public function getData( $id = NULL){
        $this->reiter=$this->db->table('reiter');
        $this->reiter->select('*');

        if ($id!=NULL){
            $this->reiter->where('id',$id);
            $result= $this->reiter->get();
            return $result->getRowArray();
        }
        $this->reiter->orderBy('id');
        $result= $this->reiter->get();